# RoomName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomName Property
ParameterTypeId Class See Also
---
"Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace